backend/app/controllers/api/v1/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
---
    def index
       # binding.pry
        pokemons = Pokemon.all.uniq{|p| p.species}

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 3]]
---
    def destroy
        trainers_pokemons = Pokemon.find(params[:id])
        if trainers_pokemons.destroy

SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "pokemons" ("species", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["species", "Pikachu"], ["trainer_id", 1], ["created_at", "2021-02-23 05:08:47.950056"], ["updated_at", "2021-02-23 05:08:47.950056"]]
---
    def create
        #binding.pry
        trainer = Trainer.find(params[:pokemons][:trainer_id])
        current_pokemon = Trainer.find(trainer.id).pokemons
        pokemon = Pokemon.create(species: params[:pokemons][:species])