backend/app/controllers/api/v1/trainers_controller.rb

    def show
       # binding.pry
        trainer = Trainer.find_by(id: params[:id]) || Trainer.find_by(name: params[:id])
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."name" = ? LIMIT ?  [["name", "Sean"], ["LIMIT", 1]]