backend/app/controllers/api/v1/trainers_controller.rb

    def index
        trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"

    def create
        if Trainer.find_by(:name => trainer_params[:name])
            trainer = Trainer.find_by(:name => trainer_params[:name])
            redirect_to "/api/v1/trainers/#{trainer.id}"
        else
            trainer = Trainer.create(trainer_params)
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."name" = ? LIMIT ?  [["name", "Sean"], ["LIMIT", 1]]
INSERT INTO "trainers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Jake"], ["created_at", "2021-02-19 04:18:53.276126"], ["updated_at", "2021-02-19 04:18:53.276126"]]

    def show
        trainer = Trainer.find_by(:id => params[:id].to_i)
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]