backend/app/controllers/api/v1/trainers_pokemons_controller.rb

SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 1]]
---
    def delete
        trainer = Trainer.find(params[:trainer_id])
        pokemon = Pokemon.find(params[:pokemon_id])
        trainer.pokemons.destroy(pokemon)