backend/app/controllers/api/v1/trainers_pokemons_controller.rb

    def index
        trainerspokemons = TrainersPokemon.all
---
SELECT "pokemons".* FROM "pokemons"
SELECT "trainers_pokemons".* FROM "trainers_pokemons"

    def create
        #binding.pry
        trainer = Trainer.find(params[:trainers_pokemon][:trainer_id])
        current_pokemon = Trainer.find(trainer.id).pokemons
        pokemon = Pokemon.create(species: params[:trainers_pokemon][:species])
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "trainers_pokemons".* FROM "trainers_pokemons" WHERE "trainers_pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
INSERT INTO "trainers_pokemons" ("trainer_id", "pokemon_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trainer_id", 1], ["pokemon_id", 13], ["created_at", "2021-02-25 05:38:30.568374"], ["updated_at", "2021-02-25 05:38:30.568374"]]